{
  "creationSource": null,
  "name": "Defender For Endpoint Base Line 24H2",
  "description": "Ready for testing. ",
  "platforms": "windows10",
  "technologies": "mdm",
  "roleScopeTagIds": [
    "0"
  ],
  "settings": [
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingCollectionInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_deviceinstall_classes_deny_list",
              "simpleSettingCollectionValue": [
                {
                  "value": "{d48179be-ec20-11d1-b6b8-00c04fa372a7}",
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationStringSettingValue"
                }
              ],
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "48365ec4-7dd6-480c-b936-9971b43d817e"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_deviceinstall_classes_deny_retroactive",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_policy_config_deviceinstallation_preventinstallationofmatchingdevicesetupclasses_deviceinstall_classes_deny_retroactive_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "9508b20e-93d6-4cb2-be7d-760cb10ab972"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "be0635e2-5791-42d1-a325-eb4c6ed3452d"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "fb131912-ce30-464c-b84b-a8dab771cc66"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "3803f09f-9d87-4038-aed3-946a5aae32ab"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrequireactivedirectorybackup_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "57eecf2a-c96d-4bc7-962f-bde31ef89c53"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "6e2419cf-7bf7-4608-a63d-8c22890f04b5"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvallowdra_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "5816312b-cce2-4cbe-af9e-4279eacd568b"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "60bd4aa4-464a-473a-b621-923ce76ce5d0"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackupdropdown_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "3afdd47e-996c-4a19-a3c4-7981849e15c8"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "a0920f5a-75a0-4be3-b67b-2d96d610f436"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverykeyusagedropdown_name_2",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "6e39b9a5-2451-4c68-beac-3a0f92b185b3"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "8c936048-dc60-4e75-9b17-0f27fabfdb24"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvactivedirectorybackup_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "91c1a6a2-fc07-45f3-9782-533d898f4924"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "0e71ecf3-529b-4aff-ae53-011d6360d4b0"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvhiderecoverypage_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "425acb49-7dec-46e0-9886-c295951836b2"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "71974c4a-2668-4913-aef0-9094363085ba"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_fixeddrivesrecoveryoptions_fdvrecoverypasswordusagedropdown_name_2",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "0d4188a1-6b61-40d8-ad8c-05ab7c02c722"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "9063375f-9505-42da-b047-9cb11552d151"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "e88fa0ae-49ef-4e76-84cc-cd8332221bb6"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "6cb5ecd0-769d-46ac-89d2-3d908da2c80a"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesrequireencryption",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_bitlocker_fixeddrivesrequireencryption_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "faae236e-a165-4699-97e8-8725b1b898e6"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "44e22c12-0b44-4ddb-bd3f-6aadaf883da4"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_fixeddrivesencryptiontype_fdvencryptiontypedropdown_name_2",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "6ab99384-2e31-4cd3-b50e-c94a66019817"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "dbdf2d93-0379-4eb2-a546-64518d9c47f5"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "5b8b7c0f-e3e9-4b78-92d4-d142ff3df4be"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "6e2f7ebd-95c2-446a-aae3-b43d5aa8d7af"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesenableprebootpinexceptionondecapabledevice",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_bitlocker_systemdrivesenableprebootpinexceptionondecapabledevice_0",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "2e2000bd-b478-47b6-bce5-acdc83c83a85"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "b7a6f816-3dcd-47da-bef0-439e5931be32"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesenhancedpin",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_bitlocker_systemdrivesenhancedpin_0",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "32636c59-f5bc-4377-b68b-bb32a100fee0"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "ec4bc4cb-cf98-42a7-bdfe-6dfe2ea4ff68"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_oshiderecoverypage_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "b1227032-0667-47cc-bb7b-3957376defea"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "a56ab7ca-62f9-4201-8ec5-2440933d8e64"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osallowdra_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f2d73e16-3edc-4e02-88ed-d67175a1b8fd"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "b6dd471c-c97b-4356-887d-1a7041c542eb"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverykeyusagedropdown_name_2",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "749d1902-3e2a-43ba-a6df-e54b6629c329"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "daf6e395-1a18-4de7-9ea7-b299a03c41d1"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackupdropdown_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "02adae43-32ee-4379-80de-07299396ecfd"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "8c24ddb4-802f-4813-9563-0a801ac296e3"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrequireactivedirectorybackup_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "6c45cd13-fec1-4dbe-a014-d6fb60c0dc57"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "738478fc-b7a1-4148-9fbb-c0df268b0232"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osactivedirectorybackup_name_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f450462b-3025-44ad-85c1-0bbb4b1a82f9"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "79f307f4-0665-4255-819a-fd3e6f05f1bb"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_systemdrivesrecoveryoptions_osrecoverypasswordusagedropdown_name_2",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "d37539ad-4d06-4ca9-a2da-f8f9318b1430"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "96b61b95-0791-45e2-91c3-54a43ddf8143"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "123d9c1e-3918-4472-b6e9-093616d77f16"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "0d560665-1035-4ace-baa5-5756edc4b157"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_bitlocker_systemdrivesenableprebootinputprotectorsonslates_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "50455d44-5816-4dd9-90d9-91710d863110"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "7cdb730c-b91a-4bfa-b189-e31899c5c48a"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_systemdrivesencryptiontype_osencryptiontypedropdown_name_2",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "30b446cc-5af7-4b92-93f8-8e17091bbcc0"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "7b53ed69-07d5-4a24-8ea1-fbb670763aaa"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "2236adac-f98c-4482-b85c-8691e2c0db13"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "33232649-0bce-4dfb-b19a-821551e513b0"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmpinkeyusagedropdown_name_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "7486d7e6-bc0b-4933-ae1e-713965ae0b9e"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "e4c3459b-521b-46de-a664-1ec5817ca0f1"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmusagedropdown_name_2",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "9afc5860-034c-42b7-a990-ee680332ce33"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "207ab617-b42c-42b8-bd0c-a25e345d6f17"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurenontpmstartupkeyusage_name_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "5eb1d4d1-76cf-4681-890a-57cdcc18d0c2"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "c98ccd65-114a-4375-866d-9c566722d848"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configurepinusagedropdown_name_2",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "8f2718cb-edcd-4529-aa03-649e40d83921"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "469b6d9e-c52d-4c2b-8c14-5cebac9f040e"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_systemdrivesrequirestartupauthentication_configuretpmstartupkeyusagedropdown_name_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "93bbe196-0dfc-4977-b378-8e0bb6e620fe"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "0b38493e-ef16-485b-87d3-6eaaf70895a9"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "440762c8-38c8-4646-89e6-40e09f6d03b6"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "04deae1a-9c84-47ae-8097-9f185ab9cd9d"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvallowbde_name_1",
                "children": [
                  {
                    "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                    "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype",
                    "choiceSettingValue": {
                      "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                      "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_1",
                      "children": [
                        {
                          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                          "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name",
                          "choiceSettingValue": {
                            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                            "value": "device_vendor_msft_bitlocker_removabledrivesencryptiontype_rdvencryptiontypedropdown_name_2",
                            "children": [],
                            "settingValueTemplateReference": {
                              "settingValueTemplateId": "f9670c0b-1c1f-4c6c-aa6c-f1a309e18816"
                            }
                          },
                          "settingInstanceTemplateReference": {
                            "settingInstanceTemplateId": "d560575a-f340-4bf9-a1c2-b62cb70b77de"
                          }
                        }
                      ],
                      "settingValueTemplateReference": {
                        "settingValueTemplateId": "fa0776d2-e8da-4b91-aba0-3ae3286c8b56"
                      }
                    },
                    "settingInstanceTemplateReference": {
                      "settingInstanceTemplateId": "06eea8f3-0a0a-45f0-a65e-0d261255c1fa"
                    }
                  }
                ],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "64febf76-8d60-421b-bfce-dfb5916bb40a"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "af91d163-90ad-4ac5-966b-700cb5ff62c4"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_removabledrivesconfigurebde_rdvdisablebde_name_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "cb729419-c789-4a6f-9bbc-aab25289c25f"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "cc7591f1-65cd-4c05-9e8e-f53a76a2a93e"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "dd0511eb-0e2c-471d-8110-2e26b45e26cc"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "6f3faf0c-c9ea-4add-ad1a-1a84419e9400"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_removabledrivesrequireencryption_rdvcrossorg_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "8da69844-4da4-45e5-b78b-9e48a6c98343"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "efc0b411-f6cf-48e4-a4e5-0389492cf569"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "6f26653b-9fc2-4878-b383-6bc95274244d"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "8db96fbf-a2d7-47ae-9fe9-0915249ea7a3"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsrdvdropdown_name_3",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "9e08fb65-8d21-42a0-9c6b-79c5c0942fa5"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "7ec510b2-62f5-4467-95f6-df741f4b6f45"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsosdropdown_name_6",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "c21c4faa-a7f4-4840-b6ab-dc67123a105d"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "007dd9a6-54b6-4e03-9403-17b919346fa8"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_bitlocker_encryptionmethodbydrivetype_encryptionmethodwithxtsfdvdropdown_name_6",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "75882676-9a13-4efb-97f6-5f77ef22b5e1"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "47a34c81-a8ab-49aa-a460-595f862df95b"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "b83adf14-b420-4fbb-b08e-a67b9d19e082"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "fc2802f4-a3d6-4e37-8c58-d87592ee0185"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_admx_windowsexplorer_enablesmartscreen",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_admx_windowsexplorer_enablesmartscreen_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_admx_windowsexplorer_enablesmartscreen_enablesmartscreendropdown",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_policy_config_admx_windowsexplorer_enablesmartscreen_enablesmartscreendropdown_block",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "b51c5dac-d1e3-4022-93ee-edc6e61413b1"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "b7a5518d-7559-48e2-861d-ab01f2c1790f"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "ef23702f-1466-4f94-9217-e6e68ad35b49"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "7f1ee405-3709-4afe-b5d5-75705af97114"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_disablebypassofsmartscreenwarningsaboutuncommonfiles",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_internetexplorer_disablebypassofsmartscreenwarningsaboutuncommonfiles_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "c328b24d-8552-4b80-a25c-9e1606569672"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "fd3761b3-4271-4899-8992-abae13cbcd04"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "user_vendor_msft_policy_config_internetexplorer_disablebypassofsmartscreenwarningsaboutuncommonfiles",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "user_vendor_msft_policy_config_internetexplorer_disablebypassofsmartscreenwarningsaboutuncommonfiles_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "b5d501b1-63e6-4148-a099-05e7b07eb030"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "f935a3e0-81d6-4546-98b7-c1f653531d9c"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_preventmanagingsmartscreenfilter",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_internetexplorer_preventmanagingsmartscreenfilter_1",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "device_vendor_msft_policy_config_internetexplorer_preventmanagingsmartscreenfilter_ie9safetyfilteroptions",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "device_vendor_msft_policy_config_internetexplorer_preventmanagingsmartscreenfilter_ie9safetyfilteroptions_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "712dd2c7-bcff-4951-82ce-3ada6cf7eb46"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "8f1fdc1f-b72d-43a1-ba92-5a2316d16fa4"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "3e8a6f2f-1b7f-469f-b5c0-5a771e192ed9"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "64c4f61d-053d-4912-8af6-8a154d435c27"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowarchivescanning",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowarchivescanning_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "c68cd34f-82b9-4da9-a09d-2e7b2efebbe1"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a9033310-7bdd-4394-8abb-55b647edbe22"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowbehaviormonitoring_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "cb63ce36-59cd-4fef-94c8-09831121089a"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "32ef611c-6234-4b3d-8625-213f9093a5c9"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowcloudprotection",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowcloudprotection_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "7719b2ad-f690-493f-8d44-567f343c6b12"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "787df6bc-f7af-4f39-9ab2-c9ad280130ba"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowemailscanning",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowemailscanning_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "778373cd-a915-44fa-a76f-82722f0242b3"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "ae01cfde-974e-46be-850e-dfde5ae89bb7"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowfullscanremovabledrivescanning_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "0922b479-f94b-4e7d-9d1c-f89063c45ce3"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "fea4a9ea-79b5-4472-8f02-f5465ab91a66"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowonaccessprotection",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowonaccessprotection_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "f437f139-aaa0-4f8a-8898-56a21a7303eb"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "c286202e-7c9b-437c-931b-da19cd3783ed"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowrealtimemonitoring_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "da5d715c-b046-4d8a-b281-cf9a76fca8a4"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "775f8729-9ce5-4b6f-8afd-1ab61891d195"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowscanningnetworkfiles",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowscanningnetworkfiles_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "60937510-8e73-4e4d-8b49-8da6ec21e2f5"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "beb59c6e-aeef-428d-a01f-50cd1e55fcbb"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowioavprotection",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowioavprotection_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "c206746f-19bd-4f24-a0be-cd14e646d5cc"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "582be4eb-44da-4164-af90-a19e9c25a18e"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowscriptscanning",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowscriptscanning_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "a31fd9db-3538-4f25-ae6b-48948bc8f26b"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "bf36d3ca-d40d-422c-a6b2-2608a3d21ca4"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_allowuseruiaccess",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_allowuseruiaccess_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "5ab2c344-8780-42eb-8a8f-c4ee59f182bb"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a5839f4c-bf1e-44fa-8f8c-b8d369a5c895"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationGroupSettingCollectionInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules",
        "groupSettingCollectionValue": [
          {
            "children": [
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutionofpotentiallyobfuscatedscripts",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutionofpotentiallyobfuscatedscripts_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwin32apicallsfromofficemacros",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwin32apicallsfromofficemacros_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablefilesrunningunlesstheymeetprevalenceagetrustedlistcriterion",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablefilesrunningunlesstheymeetprevalenceagetrustedlistcriterion_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficecommunicationappfromcreatingchildprocesses",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficecommunicationappfromcreatingchildprocesses_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockallofficeapplicationsfromcreatingchildprocesses",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockallofficeapplicationsfromcreatingchildprocesses_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockadobereaderfromcreatingchildprocesses",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockadobereaderfromcreatingchildprocesses_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockcredentialstealingfromwindowslocalsecurityauthoritysubsystem",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockcredentialstealingfromwindowslocalsecurityauthoritysubsystem_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockjavascriptorvbscriptfromlaunchingdownloadedexecutablecontent",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockjavascriptorvbscriptfromlaunchingdownloadedexecutablecontent_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwebshellcreationforservers",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockwebshellcreationforservers_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuntrustedunsignedprocessesthatrunfromusb_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockabuseofexploitedvulnerablesigneddrivers_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockpersistencethroughwmieventsubscription_audit",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuseofcopiedorimpersonatedsystemtools",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockuseofcopiedorimpersonatedsystemtools_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockprocesscreationsfrompsexecandwmicommands",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockprocesscreationsfrompsexecandwmicommands_audit",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfromcreatingexecutablecontent",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfromcreatingexecutablecontent_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfrominjectingcodeintootherprocesses",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockofficeapplicationsfrominjectingcodeintootherprocesses_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockrebootingmachineinsafemode",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockrebootingmachineinsafemode_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_useadvancedprotectionagainstransomware",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_useadvancedprotectionagainstransomware_block",
                  "children": []
                }
              },
              {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
                "settingDefinitionId": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablecontentfromemailclientandwebmail",
                "choiceSettingValue": {
                  "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                  "value": "device_vendor_msft_policy_config_defender_attacksurfacereductionrules_blockexecutablecontentfromemailclientandwebmail_block",
                  "children": []
                }
              }
            ]
          }
        ],
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "c1d89476-ce60-45a3-bdd7-eb378e54f826"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_checkforsignaturesbeforerunningscan_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "9fd68849-f92b-4bcb-9024-437339f2f085"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "ccf1e60a-1ae5-48ef-82c5-c43b83f40f51"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudblocklevel",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_cloudblocklevel_2",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "ccd0decb-f889-488c-919f-efb3d5999ccd"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d40b50b7-d140-4b65-8a8c-fb8187253083"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_cloudextendedtimeout",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 50,
          "settingValueTemplateReference": {
            "settingValueTemplateId": "206cac30-206c-413c-a8a4-ac49e5bcfc9c"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "e8a35780-23ca-404d-b633-a13043fd319e"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_disablelocaladminmerge",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_disablelocaladminmerge_0",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "64c062e6-5196-4d90-8f14-e99cc1c51d92"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "85c48954-014f-4a61-958b-993517f45de1"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_enablenetworkprotection",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_enablenetworkprotection_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "7166fed9-046b-4cf1-a422-c62c121c4a4f"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "4ee504a7-ed61-4b40-88e9-2a08b78e5801"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_hideexclusionsfromlocaladmins",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_hideexclusionsfromlocaladmins_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "8c2e5491-150b-47e3-b4ac-8ba158c62d92"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a7d8b6c2-47aa-47b0-911e-5d05efe8eb25"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_hideexclusionsfromlocalusers",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_hideexclusionsfromlocalusers_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "d4df3e6f-6583-47d7-993d-b677bdab9b5b"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "dabc32f0-094d-4aed-8a7d-a6a8b3059268"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_defender_configuration_oobeenablertpandsigupdate",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_defender_configuration_oobeenablertpandsigupdate_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "329d5e1c-c1b0-4e69-88c8-57d23b8f10f7"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "6b58ab49-2d53-4a19-937b-f82f9d854875"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_puaprotection",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_puaprotection_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "8dc5e01f-4f69-41dc-ba68-bc193151fef9"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "8736a35b-e6e3-415a-9dbb-c5101d4d5df6"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_realtimescandirection",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_realtimescandirection_0",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "5efcb76f-71c2-482b-9b0c-e92a87a70ce9"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "7bba3966-73f2-46a7-a0b8-cb8017ac14a2"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_scanparameter",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_scanparameter_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "bcaec511-9698-49e9-a794-e3cdbce2f606"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "53dd1377-80d8-4a68-a40f-df78a870d9cf"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_schedulequickscantime",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 120,
          "settingValueTemplateReference": {
            "settingValueTemplateId": "5accefc3-fe1b-435a-8cef-c6ca7601d160"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "2c460ad6-23cd-45e9-a601-1b8293e15061"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_schedulescanday",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_schedulescanday_0",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "4a0c57c6-e741-4efe-bd07-47719c928dd5"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "87634bb8-cff1-4f25-97f3-f8d100870de2"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_schedulescantime",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 120,
          "settingValueTemplateReference": {
            "settingValueTemplateId": "5c1f90ad-6fef-4e83-bdef-af422af22d51"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "3a546569-d14c-4af9-9ed6-7fff81ea899b"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_signatureupdateinterval",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 4,
          "settingValueTemplateReference": {
            "settingValueTemplateId": "3cbffe65-7801-4a80-a0ac-07c50fda3807"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d2774c98-982c-449a-8451-9181a69ee28e"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_defender_submitsamplesconsent",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_defender_submitsamplesconsent_3",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "5b447fce-83eb-409c-8a5d-4fe9a9b0e13c"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "22595133-83c1-402f-acb5-b285e051161d"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_deviceguard_lsacfgflags",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_deviceguard_lsacfgflags_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "02461f54-5471-46c2-b39d-5daee9a166b6"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "9c840fb2-c96b-4a0e-8055-4059dbdfbc52"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_dmaguard_deviceenumerationpolicy",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_dmaguard_deviceenumerationpolicy_0",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "58025354-ea20-49e6-bd7e-b41455011ae5"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "a4aa6b0c-e539-4dab-bc4b-eeacbfd7916d"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_crlcheck",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "vendor_msft_firewall_mdmstore_global_crlcheck_0",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "43c7d9e4-f7f0-499a-94a2-7d95c6f76269"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "c81510a9-362f-4f21-82af-15b542d73c63"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_disablestatefulftp",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "vendor_msft_firewall_mdmstore_global_disablestatefulftp_true",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "148a15b6-46b5-43db-ac49-e8012869bc7b"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "bf11fa8d-6a6c-4bd6-bdcc-ff42326ae637"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "vendor_msft_firewall_mdmstore_domainprofile_enablefirewall_true",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalipsecpolicymerge_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "6d164508-e6f7-471b-8346-d2ac4df6bc28"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "675b8bfa-4628-48ea-b6e1-2c0e4453e263"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmode_false",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "17eb383e-65ff-40f1-aa1e-68f02a552278"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "10f8e91b-972b-4a00-bdd6-ffb436f88d73"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disableinboundnotifications_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "70d4f4d1-7732-45a8-81a8-f90988f3ad7b"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "63e61271-5263-44ab-bbcd-d037f242214b"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disableunicastresponsestomulticastbroadcast_false",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "4f6a528f-9193-4a50-994b-0dcb4b6aa9d2"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "9b293338-b7b1-4e76-baad-d00fe1a1393d"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_domainprofile_globalportsallowuserprefmerge_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "d66ee4cc-2bf0-45e6-8e22-38776f3f3d1e"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "8ffc90fe-d681-41cb-b825-3bf1be894d18"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_domainprofile_disablestealthmodeipsecsecuredpacketexemption_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "e327037b-fe86-41ed-adb6-1c364ead63e7"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "db8f9bdd-b911-472e-9a5a-a48cdb2eeaff"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_domainprofile_allowlocalpolicymerge_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "1f158289-7afb-4388-9af8-e72176629f79"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "29b41ca5-58fd-4545-bc91-9f3d28e5b1dd"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "dc739fe8-ee68-40f7-a6d3-6732bc2aa228"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "fa5d2aa9-6fff-46dd-80e7-d4587656d956"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingCollectionInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_enablepacketqueue",
        "choiceSettingCollectionValue": [
          {
            "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
            "value": "vendor_msft_firewall_mdmstore_global_enablepacketqueue_0",
            "children": []
          }
        ],
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "50cf952b-db10-4cb7-a4da-5f50ddb36f56"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "vendor_msft_firewall_mdmstore_privateprofile_enablefirewall_true",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_privateprofile_defaultinboundaction_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "fb13e130-dfdb-4812-bf70-8f78d3062dcb"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "a67d090e-fedf-4047-8179-3e7c59623056"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disableunicastresponsestomulticastbroadcast_false",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "674a8752-f7eb-4371-bc6d-09d9d5ac4ff6"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "d59bd0f5-ad0e-4467-b414-1bd096fbadda"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmode_false",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "e6811623-a97c-4b0d-a61d-809c9b380191"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "6a093380-00a2-4299-97a6-27c466c5f891"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_privateprofile_globalportsallowuserprefmerge_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "a782e1e2-b525-4070-8c81-1c3f3b9b860f"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "923d4639-7b53-4ae4-8935-70b6ff238b77"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalipsecpolicymerge_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "1fb508fc-8280-46da-af86-0d0fc797550c"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "4608d2d2-3331-4c1e-b095-7eb139b7cf9b"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disablestealthmodeipsecsecuredpacketexemption_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "0c0cb1eb-7553-41e7-957f-06e14a6b4cdf"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "fae57cce-8545-4943-8132-f39f41eba343"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_privateprofile_disableinboundnotifications_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "8ecc3012-0bd1-4281-9024-24a98bbe9281"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "fdb9b5cd-3a3d-43d8-9180-07e1741865c8"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_privateprofile_allowlocalpolicymerge_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "48fec582-cb7d-41ba-b200-ec9caa1a0122"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "b82ec0f7-f2b3-4e0e-a0d1-5ebead2290e4"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_privateprofile_defaultoutboundaction_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "b20ff81e-f874-4e75-932f-2033902a04fb"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "2a3eac9a-c059-43d6-93b2-246a1beb13df"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_privateprofile_authappsallowuserprefmerge_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "89db1e55-bd11-4679-a495-f10b8db794c6"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "10d03aa5-abee-41d5-a9d1-b0d90978ecab"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "d1f400f4-3fb7-4451-bb82-5d0160647295"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "751999f2-e290-4fa5-8c34-7ad53a08bd8a"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "vendor_msft_firewall_mdmstore_publicprofile_enablefirewall_true",
          "children": [
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmode_false",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "60d94547-953f-4ba0-9ce2-aeb8493d298a"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "d15e7482-db25-4457-87d7-6d27aef5c89c"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_publicprofile_defaultoutboundaction_0",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "ef5e7495-41a0-4a22-8336-9357de698e53"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "68c17e0b-17d4-47cf-9b71-2adaf8d566e0"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disableinboundnotifications_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "6081c86c-70b6-4b5b-9b33-29090a6374b5"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "925146b0-e8ee-4402-b8c8-feb69930d2cc"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disablestealthmodeipsecsecuredpacketexemption_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f352e8bb-becf-46af-992c-19cf0d19d392"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "8a1d6f87-74fb-4ea5-aad4-436d4a85a876"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalpolicymerge_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "00887e72-1460-43a6-a5a5-a38d6be1599f"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "0615ef0f-2529-4c36-90a3-eecd73bcaafd"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_publicprofile_authappsallowuserprefmerge_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "58162d40-f44a-4eb2-be0d-e20148051004"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "73fcf41e-dbab-4c08-96bf-ff6f4df67840"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_publicprofile_defaultinboundaction_1",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "ef86918b-04fe-40c6-a866-544d8fe341ea"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "fe02d5d9-29f3-4d4e-8690-f950c0b8c192"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_publicprofile_globalportsallowuserprefmerge_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "54a3b6f6-85b3-4372-b8be-b7ce536135ba"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "96f1b79a-178e-41aa-bc19-2cf7d0eb2e0a"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_publicprofile_allowlocalipsecpolicymerge_true",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "fbb7a082-794a-4862-a523-e66ac44868fe"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "3f937765-03ca-4eb9-a3ed-0be0cbc334b3"
              }
            },
            {
              "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
              "settingDefinitionId": "vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast",
              "choiceSettingValue": {
                "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
                "value": "vendor_msft_firewall_mdmstore_publicprofile_disableunicastresponsestomulticastbroadcast_false",
                "children": [],
                "settingValueTemplateReference": {
                  "settingValueTemplateId": "f6776582-73b1-44c0-a5c0-1fb637ad8411"
                }
              },
              "settingInstanceTemplateReference": {
                "settingInstanceTemplateId": "d6dce479-2fc4-4949-897a-69d89aae906f"
              }
            }
          ],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "6d458682-673f-4461-81bb-2a5078abbf11"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "b5b9150d-fcbb-43bf-bd5a-969811ed6ca2"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_presharedkeyencoding",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "vendor_msft_firewall_mdmstore_global_presharedkeyencoding_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "8c2b2ead-9cd0-4bf2-8e98-a6b54fb59e9b"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "c009d4bf-b362-4d4c-b935-1c028c8fa8c7"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationSimpleSettingInstance",
        "settingDefinitionId": "vendor_msft_firewall_mdmstore_global_saidletime",
        "simpleSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationIntegerSettingValue",
          "value": 300,
          "settingValueTemplateReference": {
            "settingValueTemplateId": "38b42090-cd6b-4e43-acd6-e4e9f297256b"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "5136680e-6c1d-4aeb-8658-fd51649445be"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_smartscreenenabled_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "ba4bc12a-4c4c-499c-9f0e-924e6d2c5b30"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "9494b3dd-d859-4fa3-8937-c1ea14853976"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_microsoft_edgev80diff~policy~microsoft_edge~smartscreen_smartscreenpuaenabled_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "9d9216a9-fc58-4f91-b2a4-580d777dd705"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "40f986ab-922f-488c-b25f-7ad3efa3d3db"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev97~policy~microsoft_edge~smartscreen_smartscreendnsrequestsenabled",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_microsoft_edgev97~policy~microsoft_edge~smartscreen_smartscreendnsrequestsenabled_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "5cc052be-1889-445f-822f-ac73b175cc8f"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "c203af5f-ca42-402b-8061-c5555ead7694"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge~smartscreen_newsmartscreenlibraryenabled",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_microsoft_edgev95~policy~microsoft_edge~smartscreen_newsmartscreenlibraryenabled_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "dc5ebc02-de95-4528-92fe-a51219eb2e40"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "e0111f00-1843-4df3-97d5-a90b350f88cd"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edgev78diff~policy~microsoft_edge~smartscreen_smartscreenfortrusteddownloadsenabled",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_microsoft_edgev78diff~policy~microsoft_edge~smartscreen_smartscreenfortrusteddownloadsenabled_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "e0e76cf1-c502-4393-a1e9-f6f7ba84be58"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "4daa59bf-7828-45a8-9b12-eeac27b7b31f"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverride_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "265a0466-95f3-4966-9470-edc298baa774"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "97362a65-b46f-4366-8283-812319daf05a"
        }
      }
    },
    {
      "@odata.type": "#microsoft.graph.deviceManagementConfigurationSetting",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles",
        "choiceSettingValue": {
          "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingValue",
          "value": "device_vendor_msft_policy_config_microsoft_edge~policy~microsoft_edge~smartscreen_preventsmartscreenpromptoverrideforfiles_1",
          "children": [],
          "settingValueTemplateReference": {
            "settingValueTemplateId": "45461f6d-b05b-4327-9664-9c3b1dc61c98"
          }
        },
        "settingInstanceTemplateReference": {
          "settingInstanceTemplateId": "d184ba06-889f-4572-a814-26ec95d091ec"
        }
      }
    }
  ],
  "templateReference": {
    "templateId": "49b8320f-e179-472e-8e2c-2fde00289ca2_1",
    "templateFamily": "baseline",
    "templateDisplayName": "Microsoft Defender for Endpoint Security Baseline",
    "templateDisplayVersion": "Version 24H1"
  }

}
